In [4]:
import pandas as pd

In [10]:
# Read CSV with flexibility and skip bad lines
df = pd.read_csv(r"C:\Users\user\Desktop\#\DA\practice\python\Salary\salaries.csv", sep='\t', engine='python', on_bad_lines='skip')
# Remove unwanted characters
df = df.replace({"Â": "", "Ê¼": "'"}, regex=True)

In [11]:
df.head()

,role,country,company,company_rating,job_title,median,low,high,unit,Unnamed: 9
0,Data Scientist,Japan,CTW,2.9,Data Scientist,"¥1,500,000",¥1M,¥18M,/ yr,NaN
1,Data Scientist,Japan,FUJIFILM,3.7,Data Scientist,"¥5,000,000",¥5M,¥7M,/ yr,NaN
2,Data Scientist,Japan,GMO Internet,3.3,Data Scientist,"¥6,500,000",¥7M,-,/ yr,NaN
3,Data Scientist,Japan,Data4Cʼs,3.0,Data Scientist,"¥350,000",¥300K,¥402K,/ mo,NaN
4,Data Scientist,Japan,Deloitte,4.0,Data Scientist,"¥6,250,000",¥5M,¥8M,/ yr,NaN

In [12]:
df.columns

Index(['role', 'country', 'company', 'company_rating', 'job_title', 'median',
       'low', 'high', 'unit', 'Unnamed: 9'],
      dtype='object')

# Data Cleaning

In [46]:
df.columns

Index(['role', 'country', 'company', 'company_rating', 'job_title', 'median',
       'low', 'high', 'unit'],
      dtype='object')

In [13]:
# Drop the 'Unnamed: 9' column
df = df.drop(columns=['Unnamed: 9'])

In [49]:
# Checking for missing values
df.isnull().sum()

role              0
country           0
company           0
company_rating    0
job_title         0
median            0
low               0
high              0
unit              0
dtype: int64

In [48]:
df['high'].fillna(df['high'].median(), inplace=True)  # or df['high'].mean()

C:\Users\user\AppData\Local\Temp\ipykernel_2488\705630652.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['high'].fillna(df['high'].median(), inplace=True)  # or df['high'].mean()

In [35]:
# Drop rows where 'company' is null
df = df.dropna(subset=['company'])

In [20]:
# Clean numeric columns by removing currency symbols, commas, and whitespace
df['median'] = pd.to_numeric(df['median'].str.replace(r'[^\d.]', '', regex=True), errors='coerce')
df['low'] = pd.to_numeric(df['low'].str.replace(r'[^\d.]', '', regex=True), errors='coerce')
df['high'] = pd.to_numeric(df['high'].str.replace(r'[^\d.]', '', regex=True), errors='coerce')

C:\Users\user\AppData\Local\Temp\ipykernel_2488\823776447.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['median'] = pd.to_numeric(df['median'].str.replace(r'[^\d.]', '', regex=True), errors='coerce')
C:\Users\user\AppData\Local\Temp\ipykernel_2488\823776447.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['low'] = pd.to_numeric(df['low'].str.replace(r'[^\d.]', '', regex=True), errors='coerce')
C:\Users\user\AppData\Local\Temp\ipykernel_2488\823776447.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['high'] = pd.to_numeric(df['high'].str.replace(r'[^\d.]', '', regex=True), errors='coerce')

In [22]:
median_rating = df['company_rating'].median()
df['company_rating'] = df['company_rating'].fillna(median_rating)

C:\Users\user\AppData\Local\Temp\ipykernel_2488\1463045581.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['company_rating'] = df['company_rating'].fillna(median_rating)

In [25]:
df.head()

,role,country,company,company_rating,job_title,median,low,high,unit
0,Data Scientist,Japan,CTW,2.9,Data Scientist,1500000,1,18.0,/ yr
1,Data Scientist,Japan,FUJIFILM,3.7,Data Scientist,5000000,5,7.0,/ yr
2,Data Scientist,Japan,GMO Internet,3.3,Data Scientist,6500000,7,NaN,/ yr
3,Data Scientist,Japan,Data4Cʼs,3.0,Data Scientist,350000,300,402.0,/ mo
4,Data Scientist,Japan,Deloitte,4.0,Data Scientist,6250000,5,8.0,/ yr

In [30]:
df[df["role"]=="Data"]

Empty DataFrame
Columns: [role, country, company, company_rating, job_title, median, low, high, unit]
Index: []

In [32]:
df.str.contains["Data"]

AttributeError: 'DataFrame' object has no attribute 'str'

In [33]:
# Filter rows where the 'role' column contains 'Data'
df[df['role'].str.contains("Data")]

,role,country,company,company_rating,job_title,median,low,high,unit
0,Data Scientist,Japan,CTW,2.9,Data Scientist,1500000,1,18.0,/ yr
1,Data Scientist,Japan,FUJIFILM,3.7,Data Scientist,5000000,5,7.0,/ yr
2,Data Scientist,Japan,GMO Internet,3.3,Data Scientist,6500000,7,NaN,/ yr
3,Data Scientist,Japan,Data4Cʼs,3.0,Data Scientist,350000,300,402.0,/ mo
4,Data Scientist,Japan,Deloitte,4.0,Data Scientist,6250000,5,8.0,/ yr
...,...,...,...,...,...,...,...,...,...
401182,Data Engineer,Romania,FinProm,2.9,Data Entry Operator,3716,4,4.0,/ mo
401183,Data Engineer,Romania,GRS,3.0,Data Entry Operator,1612,2,2.0,/ mo
401184,Data Engineer,Romania,Woods Valldata,2.6,Data Entry Operator,1648,2,2.0,/ yr
401185,Data Engineer,Romania,FM Logistic,3.5,Data Entry Operator,4908,5,5.0,/ mo
401186,Data Engineer,Romania,iCredit (Romania),2.1,Data Entry Operator,1001,969,1.0,/ mo

In [36]:
# Set display option to show all rows
pd.set_option('display.max_rows', None)
# Set display option to show all columns
pd.set_option('display.max_columns', None)

In [44]:
df[df["country"]=="China"].count()

role              3196
country           3196
company           3196
company_rating    3196
job_title         3196
median            3196
low               3196
high              3176
unit              3196
dtype: int64

In [50]:
df[df["country"]=="United States"].count()

role              47607
country           47607
company           47607
company_rating    47607
job_title         47607
median            47607
low               47607
high              47607
unit              47607
dtype: int64

In [64]:
df.head()

,role,country,company,company_rating,job_title,median,low,high,unit
0,Data Scientist,Japan,CTW,2.9,Data Scientist,1500000,1,18.0,/yr
1,Data Scientist,Japan,FUJIFILM,3.7,Data Scientist,5000000,5,7.0,/yr
2,Data Scientist,Japan,GMO Internet,3.3,Data Scientist,6500000,7,48.0,/yr
3,Data Scientist,Japan,Data4Cʼs,3.0,Data Scientist,350000,300,402.0,/mo
4,Data Scientist,Japan,Deloitte,4.0,Data Scientist,6250000,5,8.0,/yr

In [61]:
# Replace abbreviations with full terms in the 'unit' column
df['unit'] = df['unit'].replace({
    '/yr': 'per year',
    '/mo': 'per month',
    '/wk': 'per week',  # if there's a weekly rate
    '/hr': 'per hour'   # if there's an hourly rate
})

In [58]:
# Check unique values in the 'unit' column to identify exact formatting
print(df['unit'].unique())

['\xa0/\xa0yr' '\xa0/\xa0mo' '\xa0/\xa0hr']

In [65]:
# Clean extra characters and replace abbreviations with full terms
df['unit'] = df['unit'].str.replace(r'[^\w\s/]', '', regex=True).str.strip()  # Remove unwanted characters
df['unit'] = df['unit'].replace({
    '/ yr': 'per year',
    '/ mo': 'per month',
    '/ wk': 'per week',
    '/ hr': 'per hour'
})

In [62]:
# Remove non-breaking spaces and replace abbreviations
df['unit'] = df['unit'].str.replace('\xa0', '', regex=True)

In [69]:
df.head()

,role,country,company,company_rating,job_title,median,low,high,unit
0,Data Scientist,Japan,CTW,2.9,Data Scientist,1500000,1,18.0,/yr
1,Data Scientist,Japan,FUJIFILM,3.7,Data Scientist,5000000,5,7.0,/yr
2,Data Scientist,Japan,GMO Internet,3.3,Data Scientist,6500000,7,48.0,/yr
3,Data Scientist,Japan,Data4Cʼs,3.0,Data Scientist,350000,300,402.0,/mo
4,Data Scientist,Japan,Deloitte,4.0,Data Scientist,6250000,5,8.0,/yr

In [67]:
# Remove non-breaking spaces and replace abbreviations
df['unit'] = df['unit'].str.replace('\xa0', '', regex=True)

In [68]:
# Remove non-breaking spaces and replace abbreviations
df['unit'] = df['unit'].str.replace('\xa0', '', regex=True)

In [72]:
print(df['unit'].unique())

['per year' 'per month' 'per hour']

In [71]:
# Replace abbreviations with full terms
df['unit'] = df['unit'].replace({
    '/yr': 'per year',
    '/mo': 'per month',
    '/hr': 'per hour'
})

In [73]:
df.head()

,role,country,company,company_rating,job_title,median,low,high,unit
0,Data Scientist,Japan,CTW,2.9,Data Scientist,1500000,1,18.0,per year
1,Data Scientist,Japan,FUJIFILM,3.7,Data Scientist,5000000,5,7.0,per year
2,Data Scientist,Japan,GMO Internet,3.3,Data Scientist,6500000,7,48.0,per year
3,Data Scientist,Japan,Data4Cʼs,3.0,Data Scientist,350000,300,402.0,per month
4,Data Scientist,Japan,Deloitte,4.0,Data Scientist,6250000,5,8.0,per year